Ran Plan for dir: `terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.10.0 plan -input=false -refresh -out "/atlantis-data/repos/techtales-io/terraform-minio/82/default/terraform/terraform-minio-default.tfplan"' in '/atlantis-data/repos/techtales-io/terraform-minio/82/default/terraform': exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.buckets["backup"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "backup"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.buckets["cnpg"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "cnpg"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.buckets["loki"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "loki"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.buckets["terraform"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "terraform"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = true
    }

  # module.buckets["thanos"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "thanos"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.buckets["volsync"].minio_s3_bucket.main will be created
  + resource "minio_s3_bucket" "main" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "volsync"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

  # module.users["cnpg"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "cnpg"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["crowlexpro"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "crowlexpro"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["jazzlyn"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "jazzlyn"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["loki"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "loki"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["techinik"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "techinik"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["terraform"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "terraform"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["thanos"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "thanos"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["tyriis"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tyriis"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

  # module.users["volsync"].minio_iam_user.main will be created
  + resource "minio_iam_user" "main" {
      + disable_user  = false
      + force_destroy = false
      + id            = (known after apply)
      + name          = "volsync"
      + secret        = (sensitive value)
      + status        = (known after apply)
      + tags          = {
          + "managed-by" = "terraform"
        }
      + update_secret = false
    }

Plan: 15 to add, 0 to change, 0 to destroy.
╷
│ Error: Missing required argument
│ 
│ The argument "address" is required, but was not set.
╵
╷
│ Error: Invalid provider configuration
│ 
│ Provider "registry.terraform.io/hashicorp/vault" requires explicit
│ configuration. Add a provider block to the root module and configure the
│ provider's required arguments as described in the provider documentation.
│ 
╵


```
</details>